app/mailers/admin_mailer.rb

	def order_email(order)


    @order = order


    @order_user = @order.user

    @admins = User.where(is_admin: true)


    @cart = @order_user.cart


    @cart_items_ordered = @cart.items

    @admins.each do |admin|
---
SELECT "users".* FROM "users" WHERE "users"."is_admin" = $1  [["is_admin", true]]