app/controllers/carts_controller.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 11], ["created_at", "2019-09-05 06:01:25.995659"], ["updated_at", "2019-09-05 06:01:25.995659"]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."cart_id" = $1 AND "items"."id" = $2 LIMIT $3  [["cart_id", 11], ["id", 2], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]
INSERT INTO "cart_items" ("cart_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cart_id", 11], ["item_id", 2], ["created_at", "2019-09-05 06:01:56.022176"], ["updated_at", "2019-09-05 06:01:56.022176"]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def create
   if user_signed_in?
    if current_user.cart == nil
      Cart.create(user_id: current_user.id)
    end
     if current_user.cart.items.include?(Item.find(params[:format])) == false
        CartItem.create( cart: current_user.cart, item: Item.find(params[:format]) )

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 14], ["created_at", "2019-09-05 12:15:23.995756"], ["updated_at", "2019-09-05 12:15:23.995756"]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 14], ["LIMIT", 1]]
SELECT "items".* FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."cart_id" = $1  [["cart_id", 11]]
---
  def show
    if user_signed_in?
         if current_user.cart == nil
        Cart.create(user_id: current_user.id)
        end
         @price_total = 0
         @cart_items = current_user.cart.items
         @cart_items.each do |cart_item|

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."item_id" = $1 AND "cart_items"."cart_id" = $2 LIMIT $3  [["item_id", 35], ["cart_id", 13], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 12]]
---
 def destroy
   @cart_item= CartItem.find_by(item_id:params[:id], cart_id: current_user.cart.id)
   @cart_item.destroy