app/controllers/charges_controller.rb

INSERT INTO "orders" ("user_id", "stripe_customer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 11], ["stripe_customer_id", "cus_FkjdHSnkWp8X1m"], ["created_at", "2019-09-05 06:09:43.472201"], ["updated_at", "2019-09-05 06:09:43.472201"]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 11]]
SELECT "items".* FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."cart_id" = $1  [["cart_id", 11]]
INSERT INTO "order_items" ("order_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order_id", 12], ["item_id", 1], ["created_at", "2019-09-05 06:09:44.178314"], ["updated_at", "2019-09-05 06:09:44.178314"]]
---
	def create
	  @cart = current_user.cart
	  # .to_i to avoid the bug generated by the decimal
	  @amount = @cart.total_price.to_i

	  customer = Stripe::Customer.create({
	  	email: params[:stripeEmail],
	  	source: params[:stripeToken],
	  })

	  charge = Stripe::Charge.create({
	  	customer: customer.id,
	  	amount: @amount * 100,
	  	description: 'Rails Stripe customer',
	  	currency: 'eur',
	  })

		# We stock the cart's items in a variable
		@cart_items = @cart.items

		# We create a new order
		@order = Order.create(stripe_customer_id: customer.id, user_id: current_user.id)

		# Each item of this card is put in the order item table (with the id of the current order)
		@cart_items.each do |item|
			OrderItem.create(order_id: @order.id, item_id: item.id)
		end


		# we empty the cart
		CartItem.where(cart_id: @cart.id).each do |entry|