app/models/cart.rb

	def total_price
		#We set a counter at 0
		total = 0
		#We iterate through the items in the cart
		self.items.each do |item|
---
SELECT "items".* FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."cart_id" = $1  [["cart_id", 11]]